In [29]:
import pandas as pd

In [30]:
df1 = pd.DataFrame([[4,7],[36,1],[45,4]], columns=['id_pedido', 'quantidade'])
df2 = pd.DataFrame([[90,12],[24,1],[47,4]], columns=['id_pedido', 'quantidade'])

In [31]:
df1

   id_pedido  quantidade
0          4           7
1         36           1
2         45           4

In [32]:
df2

   id_pedido  quantidade
0         90          12
1         24           1
2         47           4

In [33]:
# concat
pd.concat([df1,df2])

   id_pedido  quantidade
0          4           7
1         36           1
2         45           4
0         90          12
1         24           1
2         47           4

In [34]:
pd.concat([df1,df2], ignore_index=True)

   id_pedido  quantidade
0          4           7
1         36           1
2         45           4
3         90          12
4         24           1
5         47           4

In [35]:
pd.concat([df1,df2], axis=1)

   id_pedido  quantidade  id_pedido  quantidade
0          4           7         90          12
1         36           1         24           1
2         45           4         47           4

In [36]:
df_roupas = pd.DataFrame([[1,5],[2,15],[3,25]], columns=['id_vendedor', 'vendas_roupas'])
df_calcados = pd.DataFrame([[1,30],[2,10],[4,80]], columns=['id_vendedor', 'vendas_calcados'])

In [37]:
df_roupas

   id_vendedor  vendas_roupas
0            1              5
1            2             15
2            3             25

In [38]:
df_calcados

   id_vendedor  vendas_calcados
0            1               30
1            2               10
2            4               80

In [39]:
pd.merge(df_roupas, df_calcados, on='id_vendedor')

   id_vendedor  vendas_roupas  vendas_calcados
0            1              5               30
1            2             15               10

In [40]:
pd.merge(df_roupas, df_calcados, on='id_vendedor', how='left')

   id_vendedor  vendas_roupas  vendas_calcados
0            1              5             30.0
1            2             15             10.0
2            3             25              NaN

In [41]:
pd.merge(df_roupas, df_calcados, on='id_vendedor', how='outer')

   id_vendedor  vendas_roupas  vendas_calcados
0            1            5.0             30.0
1            2           15.0             10.0
2            3           25.0              NaN
3            4            NaN             80.0

In [42]:
#append

In [43]:
df1

   id_pedido  quantidade
0          4           7
1         36           1
2         45           4

In [44]:
df2

   id_pedido  quantidade
0         90          12
1         24           1
2         47           4

In [45]:
df_total = df1.append(df2)

In [46]:
df_total

   id_pedido  quantidade
0          4           7
1         36           1
2         45           4
0         90          12
1         24           1
2         47           4

In [54]:
df_roupas = df_roupas.set_index('id_vendedor')

In [55]:
df_calcados = df_calcados.set_index('id_vendedor')

In [74]:
df_roupas

             vendas_roupas
id_vendedor
1                        5
2                       15
3                       25

In [75]:
df_calcados

             vendas_calcados
id_vendedor
1                         30
2                         10
4                         80

In [76]:
df_vendedores = pd.DataFrame([[1,'João'], [2, 'Maria'], [3, 'Carlos'], [4, 'Paulo']], columns=['id_vendedor', 'nome'])
df_vendedores.set_index('id_vendedor', inplace=True)
df_vendedores

               nome
id_vendedor
1              João
2             Maria
3            Carlos
4             Paulo

In [81]:
df_vendas = df_vendedores.copy()
df_vendas['vendas_calcados'] = pd.np.nan
df_vendas['vendas_roupas'] = pd.np.nan
df_vendas

               nome  vendas_calcados  vendas_roupas
id_vendedor
1              João              NaN            NaN
2             Maria              NaN            NaN
3            Carlos              NaN            NaN
4             Paulo              NaN            NaN

In [82]:
df_vendas.update(df_roupas)

In [83]:
df_vendas

               nome  vendas_calcados  vendas_roupas
id_vendedor
1              João              NaN            5.0
2             Maria              NaN           15.0
3            Carlos              NaN           25.0
4             Paulo              NaN            NaN

In [84]:
df_vendas.update(df_calcados)
df_vendas

               nome  vendas_calcados  vendas_roupas
id_vendedor
1              João             30.0            5.0
2             Maria             10.0           15.0
3            Carlos              NaN           25.0
4             Paulo             80.0            NaN